Repository: micgh1031/python-django-rc
Catalog: mailchimp/locale/*/LC_MESSAGES/django.po
Languages: it

source: Mailchimp Log
it: Attivita' di Mailchimp

source: Mailchimp Logs
it: Attivita' di Mailchimp

source: Home
it: Principale

source: mailchimp overview
it: Panoramica Mailchimp

source: Campaign Subject
it: Titolo campagna

source: Sent Date
it: Data Invio

source: Recipients
it: Destinatari

source: Object
it: Oggetto

source: Log
it: Attivita'

source: Subject
it: Titolo

source: First
it: Primo

source: Last
it: Ultimo

source: Queue
it: Coda

source: Actions
it: Azioni

source: Send Now!
it: Invia ora!

source: Cancel!
it: Annulla!

source: No Campaigns in the Queue
it: Nessuna campagna in coda

source: Sent via mailchimp:
it: Inviate tramite Mailchimp:

source: scheduled for sending via mailchimp
it: Programmate per essere intiate tramite Mailchimp

source: Send via Mailchimp
it: Invia tramite Mailchimp

source: Send Test Mail
it: Invia mail di prova

source: your account requires a valid email to send test mails
it: Il tuo account richied un indirizzo email valido per eseguire l'invio

source: Test Sending in Progress
it: Invio di prova in corso

source: Please do not leave the page while the test mail is being sent. This process might take several minutes.
it: Per favore non lasciare questa pagina durante l'invio di prova Questo processo potrebbe richiedere alcuni minuti
